lvx/base/Catalogs/бит_БотыTelegram.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_БотыTelegram</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Токен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НуженПинКод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПинКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбслуживатьЧаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

lvx/base/Catalogs/бит_БотыTelegram/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеЭлементамиФормыКлиент();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НуженПинКодПриИзменении(Элемент)
	
	УправлениеЭлементамиФормыКлиент();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаПроверить(Команда)
	
	ПроверитьТокен(Объект.Токен);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаНайтиЧаты(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Бот", Объект.Ссылка);
	ОткрытьФорму("Справочник.бит_БотыTelegram.Форма.ФормаСозданияЧатов", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьПрокси(Команда)
	
	ОткрытьФорму("ОбщаяФорма.бит_НастройкиПроксиТелеграм");

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УправлениеЭлементамиФормыКлиент()

	Элементы.ПинКод.Доступность = Объект.НуженПинКод;
	
КонецПроцедуры // УправлениеЭлементамиФормы()

// Процедура выполняет проверку токена.
//
&НаСервереБезКонтекста
Процедура ПроверитьТокен(Знач Токен)
	
	РезультатПроверки = Справочники.бит_БотыTelegram.ПроверитьТокен(Токен);
	
	Если РезультатПроверки.Существует Тогда
		
		ТекстСообщения = НСтр("ru='Проверка выполнена успешно.';en='Verification was successful.'");
		
	Иначе	
		
		ТекстСообщения = НСтр("ru='Ошибка выполнения проверки. %1.';en='Run-time error checking. %1.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, РезультатПроверки.Сообщение);
		
	КонецЕсли; 
	
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

#КонецОбласти
